Revit 2027 API
IFCFileReadOptions Constructor
 Creates a default IFCFileReadOptions.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IFCFileReadOptions()
Public Sub New
public:
IFCFileReadOptions()
new : unit -> IFCFileReadOptions
See Also
Reference
IFCFileReadOptions Class
Autodesk.Revit.DB.IFC Namespace